<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.144">

    <Argument name="effect" type="_300" location="f8:2890" file="f8" line="2890"/>
    <Argument name="name" type="_639" location="f8:2890" file="f8" line="2890"/>
    <Argument name="x" type="_284" location="f8:2890" file="f8" line="2890"/>
    <Argument name="y" type="_284" location="f8:2890" file="f8" line="2890"/>
    <Argument name="z" type="_284" location="f8:2890" file="f8" line="2890"/>
    <Argument name="w" type="_284" location="f8:2890" file="f8" line="2890"/>
  </Function>
  <Function id="_500" name="frContextGetAttachedPostEffectCount" returns="_278" context="_1" location="f8:2891" file="f8" line="2891" extern="1" mangled="?frContextGetAttachedPostEffectCount@@9">
    <Argument name="context" type="_289" location="f8:2891" file="f8" line="2891"/>
    <Argument name="nb" type="_660" location="f8:2891" file="f8" line="2891"/>
  </Function>
  <Function id="_501" name="frContextGetAttachedPostEffect" returns="_278" context="_1" location="f8:2892" file="f8" line="2892" extern="1" mangled="?frContextGetAttachedPostEffect@@9">
    <Argument name="context" type="_289" location="f8:2892" file="f8" line="2892"/>
    <Argument name="i" type="_279" location="f8:2892" file="f8" line="2892"/>
    <Argument name="out_effect" type="_663" location="f8:2892" file="f8" line="2892"/>
  </Function>
  <Function id="_502" name="frPostEffectGetInfo" returns="_278" context="_1" location="f8:2893" file="f8" line="2893" extern="1" mangled="?frPostEffectGetInfo@@9">
    <Argument name="effect" type="_300" location="f8:2893" file="f8" line="2893"/>
    <Argument name="info" type="_336" location="f8:2893" file="f8" line="2893"/>
    <Argument name="size" type="_6" location="f8:2893" file="f8" line="2893"/>
    <Argument name="data" type="_564" location="f8:2893" file="f8" line="2893"/>
    <Argument name="size_ret" type="_613" location="f8:2893" file="f8" line="2893"/>
  </Function>
  <Function id="_503" name="frContextCreateHeteroVolume" returns="_278" context="_1" location="f8:2894" file="f8" line="2894" extern="1" mangled="?frContextCreateHeteroVolume@@9">
    <Argument name="context" type="_289" location="f8:2894" file="f8" line="2894"/>
    <Argument name="out_heteroVolume" type="_664" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridSizeX" type="_6" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridSizeY" type="_6" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridSizeZ" type="_6" location="f8:2894" file="f8" line="2894"/>
    <Argument name="indicesList" type="_564" location="f8:2894" file="f8" line="2894"/>
    <Argument name="numberOfIndices" type="_6" location="f8:2894" file="f8" line="2894"/>
    <Argument name="indicesListTopology" type="_346" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridData" type="_564" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridDataSizeByte" type="_6" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridDataTopology___unused" type="_279" location="f8:2894" file="f8" line="2894"/>
  </Function>
  <Function id="_504" name="frShapeSetHeteroVolume" returns="_278" context="_1" location="f8:2895" file="f8" line="2895" extern="1" mangled="?frShapeSetHeteroVolume@@9">
    <Argument name="shape" type="_291" location="f8:2895" file="f8" line="2895"/>
    <Argument name="heteroVolume" type="_296" location="f8:2895" file="f8" line="2895"/>
  </Function>
  <Function id="_505" name="frHeteroVolumeSetTransform" returns="_278" context="_1" location="f8:2896" file="f8" line="2896" extern="1" mangled="?frHeteroVolumeSetTransform@@9">
    <Argument name="out_heteroVolume" type="_296" location="f8:2896" file="f8" line="2896"/>
    <Argument name="transpose" type="_287" location="f8:2896" file="f8" line="2896"/>
    <Argument name="transform" type="_650" location="f8:2896" file="f8" line="2896"/>
  </Function>
  <Typedef id="_506" name="rpr_cl_context" type="_564" context="_1" location="f9:38" file="f9" line="38"/>
  <Typedef id="_507" name="rpr_cl_device" type="_564" context="_1" location="f9:39" file="f9" line="39"/>
  <Typedef id="_508" name="rpr_cl_command_queue" type="_564" context="_1" location="f9:40" file="f9" line="40"/>
  <Typedef id="_509" name="rpr_cl_mem" type="_564" context="_1" location="f9:41" file="f9" line="41"/>
  <Typedef id="_510" name="fr_cl_context" type="_506" context="_1" location="f9:47" file="f9" line="47"/>
  <Typedef id="_511" name="fr_cl_device" type="_507" context="_1" location="f9:48" file="f9" line="48"/>
  <Typedef id="_512" name="fr_cl_command_queue" type="_508" context="_1" location="f9:49" file="f9" line="49"/>
  <Typedef id="_513" name="fr_cl_mem" type="_509" context="_1" location="f9:50" file="f9" line="50"/>
  <Unimplemented id="_514" kind="PragmaDetectMismatch"/>
  <Unimplemented id="_515" kind="PragmaDetectMismatch"/>
  <Unimplemented id="_516" kind="PragmaDetectMismatch"/>
  <Unimplemented id="_517" kind="PragmaComment"/>
  <FundamentalType id="_518" name="__int128" size="128" align="128"/>
  <FundamentalType id="_519" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_520" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_665 _666 _667 _668" size="256" align="64"/>
  <FundamentalType id="_521" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_522" type="_560" size="64" align="64"/>
  <FundamentalType id="_523" name="void" size="0" align="8"/>
  <PointerType id="_524" type="_522" size="64" align="64"/>
  <FundamentalType id="_525" name="long long int" size="64" align="64"/>
  <FundamentalType id="_526" name="bool" size="8" align="8"/>
  <PointerType id="_527" type="_669c" size="64" align="64"/>
  <FundamentalType id="_528" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_529" name="int" size="32" align="32"/>
  <FundamentalType id="_530" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_531" name="long int" size="32" align="32"/>
  <Field id="_532" name="_locale_pctype" type="_670" context="_28" access="public" location="f3:484" file="f3" line="484" offset="0"/>
  <Field id="_533" name="_locale_mb_cur_max" type="_529" context="_28" access="public" location="f3:485" file="f3" line="485" offset="64"/>
  <Field id="_534" name="_locale_lc_codepage" type="_528" context="_28" access="public" location="f3:486" file="f3" line="486" offset="96"/>
  <Constructor id="_535" name="__crt_locale_data_public" context="_28" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1"/>
  <Constructor id="_536" name="__crt_locale_data_public" context="_28" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1">
    <Argument type="_671" location="f3:482" file="f3" line="482"/>
  </Constructor>
  <OperatorMethod id="_537" name="=" returns="_672" context="_28" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1" mangled="??4__crt_locale_data_public@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_671" location="f3:482" file="f3" line="482"/>
  </OperatorMethod>
  <Destructor id="_538" name="__crt_locale_data_public" context="_28" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1"/>
  <Field id="_539" name="locinfo" type="_673" context="_30" access="public" location="f3:491" file="f3" line="491" offset="0"/>
  <Field id="_540" name="mbcinfo" type="_674" context="_30" access="public" location="f3:492" file="f3" line="492" offset="64"/>
  <Constructor id="_541" name="__crt_locale_pointers" context="_30" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1"/>
  <Constructor id="_542" name="__crt_locale_pointers" context="_30" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1">
    <Argument type="_675" location="f3:489" file="f3" line="489"/>
  </Constructor>
  <OperatorMethod id="_543" name="=" returns="_676" context="_30" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1" mangled="??4__crt_locale_pointers@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_675" location="f3:489" file="f3" line="489"/>
  </OperatorMethod>
  <Destructor id="_544" name="__crt_locale_pointers" context="_30" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1"/>
  <PointerType id="_545" type="_31" size="64" align="64"/>
  <Field id="_546" name="_Wchar" type="_557" context="_33" access="public" location="f3:499" file="f3" line="499" offset="0"/>
  <Field id="_547" name="_Byte" type="_530" context="_33" access="public" location="f3:500" file="f3" line="500" offset="32"/>
  <Field id="_548" name="_State" type="_530" context="_33" access="public" location="f3:500" file="f3" line="500" offset="48"/>
  <Constructor id="_549" name="_Mbstatet" context="_33" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1"/>
  <Constructor id="_550" name="_Mbstatet" context="_33" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1">
    <Argument type="_677" location="f3:497" file="f3" line="497"/>
  </Constructor>
  <OperatorMethod id="_551" name="=" returns="_678" context="_33" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1" mangled="??4_Mbstatet@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_677" location="f3:497" file="f3" line="497"/>
  </OperatorMethod>
  <Destructor id="_552" name="_Mbstatet" context="_33" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1"/>
  <Enumeration id="_553" name="_Uninitialized" context="_40" location="f4:612" file="f4" line="612" size="32" align="32">
    <EnumValue name="_Noinit" init="0"/>
  </Enumeration>
  <Class id="_554" name="_Lockit" context="_40" location="f4:621" file="f4" line="621" members="_679 _680 _681 _682 _683 _684 _685 _686 _687" size="32" align="32"/>
  <Class id="_555" name="_Init_locks" context="_40" location="f4:764" file="f4" line="764" members="_688 _689 _690 _691 _692 _693" size="8" align="8"/>
  <PointerType id="_556" type="_694" size="64" align="64"/>
  <FundamentalType id="_557" name="long unsigned int" size="32" align="32"/>
  <Unimplemented id="_558" type_class="Decltype"/>
  <FundamentalType id="_559" name="double" size="64" align="64"/>
  <FundamentalType id="_560" name="char" size="8" align="8"/>
  <FundamentalType id="_561" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_562" name="short int" size="16" align="16"/>
  <FundamentalType id="_563" name="float" size="32" align="32"/>
  <PointerType id="_564" type="_523" size="64" align="64"/>
  <Field id="_565" name="image_width" type="_49" context="_117" access="public" location="f8:728" file="f8" line="728" offset="0"/>
  <Field id="_566" name="image_height" type="_49" context="_117" access="public" location="f8:729" file="f8" line="729" offset="32"/>
  <Field id="_567" name="image_depth" type="_49" context="_117" access="public" location="f8:730" file="f8" line="730" offset="64"/>
  <Field id="_568" name="image_row_pitch" type="_49" context="_117" access="public" location="f8:731" file="f8" line="731" offset="96"/>
  <Field id="_569" name="image_slice_pitch" type="_49" context="_117" access="public" location="f8:732" file="f8" line="732" offset="128"/>
  <Constructor id="_570" name="_rpr_image_desc" context="_117" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1"/>
  <Constructor id="_571" name="_rpr_image_desc" context="_117" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1">
    <Argument type="_695" location="f8:726" file="f8" line="726"/>
  </Constructor>
  <OperatorMethod id="_572" name="=" returns="_696" context="_117" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1" mangled="??4_rpr_image_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_695" location="f8:726" file="f8" line="726"/>
  </OperatorMethod>
  <Destructor id="_573" name="_rpr_image_desc" context="_117" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1"/>
  <Field id="_574" name="nb_element" type="_49" context="_119" access="public" location="f8:739" file="f8" line="739" offset="0"/>
  <Field id="_575" name="element_type" type="_95" context="_119" access="public" location="f8:740" file="f8" line="740" offset="32"/>
  <Field id="_576" name="element_channel_size" type="_49" context="_119" access="public" location="f8:741" file="f8" line="741" offset="64"/>
  <Constructor id="_577" name="_rpr_buffer_desc" context="_119" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1"/>
  <Constructor id="_578" name="_rpr_buffer_desc" context="_119" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1">
    <Argument type="_697" location="f8:737" file="f8" line="737"/>
  </Constructor>
  <OperatorMethod id="_579" name="=" returns="_698" context="_119" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1" mangled="??4_rpr_buffer_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_697" location="f8:737" file="f8" line="737"/>
  </OperatorMethod>
  <Destructor id="_580" name="_rpr_buffer_desc" context="_119" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1"/>
  <Field id="_581" name="fb_width" type="_49" context="_121" access="public" location="f8:748" file="f8" line="748" offset="0"/>
  <Field id="_582" name="fb_height" type="_49" context="_121" access="public" location="f8:749" file="f8" line="749" offset="32"/>
  <Constructor id="_583" name="_rpr_framebuffer_desc" context="_121" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1"/>
  <Constructor id="_584" name="_rpr_framebuffer_desc" context="_121" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1">
    <Argument type="_699" location="f8:746" file="f8" line="746"/>
  </Constructor>
  <OperatorMethod id="_585" name="=" returns="_700" context="_121" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1" mangled="??4_rpr_framebuffer_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_699" location="f8:746" file="f8" line="746"/>
  </OperatorMethod>
  <Destructor id="_586" name="_rpr_framebuffer_desc" context="_121" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1"/>
  <Field id="_587" name="gpumem_usage" type="_56" context="_123" access="public" location="f8:756" file="f8" line="756" offset="0"/>
  <Field id="_588" name="gpumem_total" type="_56" context="_123" access="public" location="f8:757" file="f8" line="757" offset="64"/>
  <Field id="_589" name="gpumem_max_allocation" type="_56" context="_123" access="public" location="f8:758" file="f8" line="758" offset="128"/>
  <Field id="_590" name="sysmem_usage" type="_56" context="_123" access="public" location="f8:759" file="f8" line="759" offset="192"/>
  <Constructor id="_591" name="_rpr_render_statistics" context="_123" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1"/>
  <Constructor id="_592" name="_rpr_render_statistics" context="_123" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1">
    <Argument type="_701" location="f8:754" file="f8" line="754"/>
  </Constructor>
  <OperatorMethod id="_593" name="=" returns="_702" context="_123" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1" mangled="??4_rpr_render_statistics@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_701" location="f8:754" file="f8" line="754"/>
  </OperatorMethod>
  <Destructor id="_594" name="_rpr_render_statistics" context="_123" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1"/>
  <Field id="_595" name="num_components" type="_49" context="_125" access="public" location="f8:766" file="f8" line="766" offset="0"/>
  <Field id="_596" name="type" type="_94" context="_125" access="public" location="f8:767" file="f8" line="767" offset="32"/>
  <Constructor id="_597" name="_rpr_image_format" context="_125" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1"/>
  <Constructor id="_598" name="_rpr_image_format" context="_125" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1">
    <Argument type="_703" location="f8:764" file="f8" line="764"/>
  </Constructor>
  <OperatorMethod id="_599" name="=" returns="_704" context="_125" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1" mangled="??4_rpr_image_format@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_703" location="f8:764" file="f8" line="764"/>
  </OperatorMethod>
  <Destructor id="_600" name="_rpr_image_format" context="_125" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1"/>
  <Field id="_601" name="w" type="_48" context="_127" access="public" location="f8:774" file="f8" line="774" offset="0"/>
  <Field id="_602" name="h" type="_48" context="_127" access="public" location="f8:775" file="f8" line="775" offset="32"/>
  <Field id="_603" name="data" type="_609" context="_127" access="public" location="f8:776" file="f8" line="776" offset="64"/>
  <Field id="_604" name="filename" type="_609" context="_127" access="public" location="f8:777" file="f8" line="777" offset="128"/>
  <Constructor id="_605" name="_rpr_ies_image_desc" context="_127" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1"/>
  <Constructor id="_606" name="_rpr_ies_image_desc" context="_127" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1">
    <Argument type="_705" location="f8:772" file="f8" line="772"/>
  </Constructor>
  <OperatorMethod id="_607" name="=" returns="_706" context="_127" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1" mangled="??4_rpr_ies_image_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_705" location="f8:772" file="f8" line="772"/>
  </OperatorMethod>
  <Destructor id="_608" name="_rpr_ies_image_desc" context="_127" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1"/>
  <PointerType id="_609" type="_46c" size="64" align="64"/>
  <CvQualifiedType id="_46c" type="_46" const="1"/>
  <PointerType id="_610" type="_48" size="64" align="64"/>
  <PointerType id="_611" type="_71c" size="64" align="64"/>
  <CvQualifiedType id="_71c" type="_71" const="1"/>
  <PointerType id="_612" type="_59" size="64" align="64"/>
  <PointerType id="_613" type="_6" size="64" align="64"/>
  <PointerType id="_614" type="_67" size="64" align="64"/>
  <PointerType id="_615" type="_63" size="64" align="64"/>
  <PointerType id="_616" type="_118c" size="64" align="64"/>
  <CvQualifiedType id="_118c" type="_118" const="1"/>
  <PointerType id="_617" type="_523c" size="64" align="64"/>
  <CvQualifiedType id="_523c" type="_523" const="1"/>
  <PointerType id="_618" type="_64" size="64" align="64"/>
  <PointerType id="_619" type="_120c" size="64" align="64"/>
  <CvQualifiedType id="_120c" type="_120" const="1"/>
  <PointerType id="_620" type="_65" size="64" align="64"/>
  <PointerType id="_621" type="_61" size="64" align="64"/>
  <PointerType id="_622" type="_54c" size="64" align="64"/>
  <CvQualifiedType id="_54c" type="_54" const="1"/>
  <PointerType id="_623" type="_48c" size="64" align="64"/>
  <CvQualifiedType id="_48c" type="_48" const="1"/>
  <PointerType id="_624" type="_622" size="64" align="64"/>
  <PointerType id="_625" type="_6c" size="64" align="64"/>
  <CvQualifiedType id="_6c" type="_6" const="1"/>
  <PointerType id="_626" type="_623" size="64" align="64"/>
  <PointerType id="_627" type="_83c" size="64" align="64"/>
  <CvQualifiedType id="_83c" type="_83" const="1"/>
  <PointerType id="_628" type="_60" size="64" align="64"/>
  <PointerType id="_629" type="_122c" size="64" align="64"/>
  <CvQualifiedType id="_122c" type="_122" const="1"/>
  <PointerType id="_630" type="_54" size="64" align="64"/>
  <PointerType id="_631" type="_62" size="64" align="64"/>
  <PointerType id="_632" type="_68" size="64" align="64"/>
  <PointerType id="_633" type="_49" size="64" align="64"/>
  <PointerType id="_634" type="_69" size="64" align="64"/>
  <PointerType id="_635" type="_72" size="64" align="64"/>
  <PointerType id="_636" type="_560c" size="64" align="64"/>
  <CvQualifiedType id="_560c" type="_560" const="1"/>
  <PointerType id="_637" type="_70" size="64" align="64"/>
  <PointerType id="_638" type="_66" size="64" align="64"/>
  <PointerType id="_639" type="_276c" size="64" align="64"/>
  <CvQualifiedType id="_276c" type="_276" const="1"/>
  <PointerType id="_640" type="_278" size="64" align="64"/>
  <PointerType id="_641" type="_301c" size="64" align="64"/>
  <CvQualifiedType id="_301c" type="_301" const="1"/>
  <PointerType id="_642" type="_289" size="64" align="64"/>
  <PointerType id="_643" type="_297" size="64" align="64"/>
  <PointerType id="_644" type="_293" size="64" align="64"/>
  <PointerType id="_645" type="_348c" size="64" align="64"/>
  <CvQualifiedType id="_348c" type="_348" const="1"/>
  <PointerType id="_646" type="_294" size="64" align="64"/>
  <PointerType id="_647" type="_350c" size="64" align="64"/>
  <CvQualifiedType id="_350c" type="_350" const="1"/>
  <PointerType id="_648" type="_295" size="64" align="64"/>
  <PointerType id="_649" type="_291" size="64" align="64"/>
  <PointerType id="_650" type="_284c" size="64" align="64"/>
  <CvQualifiedType id="_284c" type="_284" const="1"/>
  <PointerType id="_651" type="_278c" size="64" align="64"/>
  <CvQualifiedType id="_278c" type="_278" const="1"/>
  <PointerType id="_652" type="_650" size="64" align="64"/>
  <PointerType id="_653" type="_651" size="64" align="64"/>
  <PointerType id="_654" type="_313c" size="64" align="64"/>
  <CvQualifiedType id="_313c" type="_313" const="1"/>
  <PointerType id="_655" type="_290" size="64" align="64"/>
  <PointerType id="_656" type="_352c" size="64" align="64"/>
  <CvQualifiedType id="_352c" type="_352" const="1"/>
  <PointerType id="_657" type="_284" size="64" align="64"/>
  <PointerType id="_658" type="_292" size="64" align="64"/>
  <PointerType id="_659" type="_298" size="64" align="64"/>
  <PointerType id="_660" type="_279" size="64" align="64"/>
  <PointerType id="_661" type="_299" size="64" align="64"/>
  <PointerType id="_662" type="_302" size="64" align="64"/>
  <PointerType id="_663" type="_300" size="64" align="64"/>
  <PointerType id="_664" type="_296" size="64" align="64"/>
  <Field id="_665" name="isa" type="_707" context="_520" access="public" offset="0"/>
  <Field id="_666" name="flags" type="_529" context="_520" access="public" offset="64"/>
  <Field id="_667" name="str" type="_636" context="_520" access="public" offset="128"/>
  <Field id="_668" name="length" type="_531" context="_520" access="public" offset="192"/>
  <CvQualifiedType id="_669c" type="_669" const="1"/>
  <PointerType id="_670" type="_530c" size="64" align="64"/>
  <CvQualifiedType id="_530c" type="_530" const="1"/>
  <ReferenceType id="_671" type="_28c" size="64" align="64"/>
  <CvQualifiedType id="_28c" type="_28" const="1"/>
  <ReferenceType id="_672" type="_28" size="64" align="64"/>
  <PointerType id="_673" type="_708" size="64" align="64"/>
  <PointerType id="_674" type="_709" size="64" align="64"/>
  <ReferenceType id="_675" type="_30c" size="64" align="64"/>
  <CvQualifiedType id="_30c" type="_30" const="1"/>
  <ReferenceType id="_676" type="_30" size="64" align="64"/>
  <ReferenceType id="_677" type="_33c" size="64" align="64"/>
  <CvQualifiedType id="_33c" type="_33" const="1"/>
  <ReferenceType id="_678" type="_33" size="64" align="64"/>
  <Constructor id="_679" name="_Lockit" context="_554" access="public" location="f4:644" file="f4" line="644"/>
  <Constructor id="_680" name="_Lockit" context="_554" access="public" location="f4:645" file="f4" line="645" explicit="1">
    <Argument type="_529" location="f4:645" file="f4" line="645"/>
  </Constructor>
  <Destructor id="_681" name="_Lockit" context="_554" access="public" location="f4:646" file="f4" line="646"/>
  <Method id="_682" name="_Lockit_ctor" returns="_523" context="_554" access="public" location="f4:649" file="f4" line="649" static="1" mangled="?_Lockit_ctor@_Lockit@std@@SAXH@Z">
    <Argument type="_529" location="f4:649" file="f4" line="649"/>
  </Method>
  <Method id="_683" name="_Lockit_dtor" returns="_523" context="_554" access="public" location="f4:650" file="f4" line="650" static="1" mangled="?_Lockit_dtor@_Lockit@std@@SAXH@Z">
    <Argument type="_529" location="f4:650" file="f4" line="650"/>
  </Method>
  <Method id="_684" name="_Lockit_ctor" returns="_523" context="_554" access="private" location="f4:653" file="f4" line="653" static="1" mangled="?_Lockit_ctor@_Lockit@std@@CAXPEAV12@@Z">
    <Argument type="_710" location="f4:653" file="f4" line="653"/>
  </Method>
  <Method id="_685" name="_Lockit_ctor" returns="_523" context="_554" access="private" location="f4:654" file="f4" line="654" static="1" mangled="?_Lockit_ctor@_Lockit@std@@CAXPEAV12@H@Z">
    <Argument type="_710" location="f4:654" file="f4" line="654"/>
    <Argument type="_529" location="f4:654" file="f4" line="654"/>
  </Method>
  <Method id="_686" name="_Lockit_dtor" returns="_523" context="_554" access="private" location="f4:655" file="f4" line="655" static="1" mangled="?_Lockit_dtor@_Lockit@std@@CAXPEAV12@@Z">
    <Argument type="_710" location="f4:655" file="f4" line="655"/>
  </Method>
  <Field id="_687" name="_Locktype" type="_529" context="_554" access="private" location="f4:662" file="f4" line="662" offset="0"/>
  <Constructor id="_688" name="_Init_locks" context="_555" access="public" location="f4:780" file="f4" line="780"/>
  <Destructor id="_689" name="_Init_locks" context="_555" access="public" location="f4:781" file="f4" line="781"/>
  <Method id="_690" name="_Init_locks_ctor" returns="_523" context="_555" access="private" location="f4:785" file="f4" line="785" static="1" mangled="?_Init_locks_ctor@_Init_locks@std@@CAXPEAV12@@Z">
    <Argument type="_711" location="f4:785" file="f4" line="785"/>
  </Method>
  <Method id="_691" name="_Init_locks_dtor" returns="_523" context="_555" access="private" location="f4:786" file="f4" line="786" static="1" mangled="?_Init_locks_dtor@_Init_locks@std@@CAXPEAV12@@Z">
    <Argument type="_711" location="f4:786" file="f4" line="786"/>
  </Method>
  <Constructor id="_692" name="_Init_locks" context="_555" access="public" location="f4:764" file="f4" line="764" inline="1" artificial="1">
    <Argument type="_712" location="f4:764" file="f4" line="764"/>
  </Constructor>
  <OperatorMethod id="_693" name="=" returns="_713" context="_555" access="public" location="f4:764" file="f4" line="764" inline="1" artificial="1" mangled="??4_Init_locks@std@@QEAAAEAV01@AEBV01@@Z">
    <Argument type="_712" location="f4:764" file="f4" line="764"/>
  </OperatorMethod>
  <ReferenceType id="_695" type="_117c" size="64" align="64"/>
  <CvQualifiedType id="_117c" type="_117" const="1"/>
  <ReferenceType id="_696" type="_117" size="64" align="64"/>
  <ReferenceType id="_697" type="_119c" size="64" align="64"/>
  <CvQualifiedType id="_119c" type="_119" const="1"/>
  <ReferenceType id="_698" type="_119" size="64" align="64"/>
  <ReferenceType id="_699" type="_121c" size="64" align="64"/>
  <CvQualifiedType id="_121c" type="_121" const="1"/>
  <ReferenceType id="_700" type="_121" size="64" align="64"/>
  <ReferenceType id="_701" type="_123c" size="64" align="64"/>
  <CvQualifiedType id="_123c" type="_123" const="1"/>
  <ReferenceType id="_702" type="_123" size="64" align="64"/>
  <ReferenceType id="_703" type="_125c" size="64" align="64"/>
  <CvQualifiedType id="_125c" type="_125" const="1"/>
  <ReferenceType id="_704" type="_125" size="64" align="64"/>
  <ReferenceType id="_705" type="_127c" size="64" align="64"/>
  <CvQualifiedType id="_127c" type="_127" const="1"/>
  <ReferenceType id="_706" type="_127" size="64" align="64"/>
  <PointerType id="_707" type="_529c" size="64" align="64"/>
  <CvQualifiedType id="_529c" type="_529" const="1"/>
  <PointerType id="_710" type="_554" size="64" align="64"/>
  <PointerType id="_711" type="_555" size="64" align="64"/>
  <ReferenceType id="_712" type="_555c" size="64" align="64"/>
  <CvQualifiedType id="_555c" type="_555" const="1"/>
  <ReferenceType id="_713" type="_555" size="64" align="64"/>
  <FundamentalType id="_669" name="wchar_t" size="16" align="16"/>
  <FunctionType id="_694" returns="_523"/>
  <Struct id="_708" name="__crt_locale_data" context="_1" location="f3:491" file="f3" line="491" incomplete="1"/>
  <Struct id="_709" name="__crt_multibyte_data" context="_1" location="f3:492" file="f3" line="492" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\vadefs.h"/>
  <File id="f2" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\vcruntime.h"/>
  <File id="f3" name="C:\Program Files (x86)\Windows Kits\10\Include\10.0.14393.0\ucrt\corecrt.h"/>
  <File id="f4" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\yvals.h"/>
  <File id="f5" name="C:\dev\tools\castxml/share/castxml/clang\include\stddef.h"/>
  <File id="f6" name="C:\dev\tools\castxml/share/castxml/clang\include/__stddef_max_align_t.h"/>
  <File id="f7" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\cstddef"/>
