<?xml version="1.0"?>
<GCC_XML version="0.9.0" cvs_revision="1.140">

    <Argument name="x" type="_283" location="f8:2889" file="f8" line="2889"/>
    <Argument name="y" type="_283" location="f8:2889" file="f8" line="2889"/>
    <Argument name="z" type="_283" location="f8:2889" file="f8" line="2889"/>
  </Function>
  <Function id="_498" name="frPostEffectSetParameter4f" returns="_277" context="_1" location="f8:2890" file="f8" line="2890" extern="1" mangled="?frPostEffectSetParameter4f@@9">
    <Argument name="effect" type="_299" location="f8:2890" file="f8" line="2890"/>
    <Argument name="name" type="_633" location="f8:2890" file="f8" line="2890"/>
    <Argument name="x" type="_283" location="f8:2890" file="f8" line="2890"/>
    <Argument name="y" type="_283" location="f8:2890" file="f8" line="2890"/>
    <Argument name="z" type="_283" location="f8:2890" file="f8" line="2890"/>
    <Argument name="w" type="_283" location="f8:2890" file="f8" line="2890"/>
  </Function>
  <Function id="_499" name="frContextGetAttachedPostEffectCount" returns="_277" context="_1" location="f8:2891" file="f8" line="2891" extern="1" mangled="?frContextGetAttachedPostEffectCount@@9">
    <Argument name="context" type="_288" location="f8:2891" file="f8" line="2891"/>
    <Argument name="nb" type="_654" location="f8:2891" file="f8" line="2891"/>
  </Function>
  <Function id="_500" name="frContextGetAttachedPostEffect" returns="_277" context="_1" location="f8:2892" file="f8" line="2892" extern="1" mangled="?frContextGetAttachedPostEffect@@9">
    <Argument name="context" type="_288" location="f8:2892" file="f8" line="2892"/>
    <Argument name="i" type="_278" location="f8:2892" file="f8" line="2892"/>
    <Argument name="out_effect" type="_657" location="f8:2892" file="f8" line="2892"/>
  </Function>
  <Function id="_501" name="frPostEffectGetInfo" returns="_277" context="_1" location="f8:2893" file="f8" line="2893" extern="1" mangled="?frPostEffectGetInfo@@9">
    <Argument name="effect" type="_299" location="f8:2893" file="f8" line="2893"/>
    <Argument name="info" type="_335" location="f8:2893" file="f8" line="2893"/>
    <Argument name="size" type="_5" location="f8:2893" file="f8" line="2893"/>
    <Argument name="data" type="_558" location="f8:2893" file="f8" line="2893"/>
    <Argument name="size_ret" type="_607" location="f8:2893" file="f8" line="2893"/>
  </Function>
  <Function id="_502" name="frContextCreateHeteroVolume" returns="_277" context="_1" location="f8:2894" file="f8" line="2894" extern="1" mangled="?frContextCreateHeteroVolume@@9">
    <Argument name="context" type="_288" location="f8:2894" file="f8" line="2894"/>
    <Argument name="out_heteroVolume" type="_658" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridSizeX" type="_5" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridSizeY" type="_5" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridSizeZ" type="_5" location="f8:2894" file="f8" line="2894"/>
    <Argument name="indicesList" type="_558" location="f8:2894" file="f8" line="2894"/>
    <Argument name="numberOfIndices" type="_5" location="f8:2894" file="f8" line="2894"/>
    <Argument name="indicesListTopology" type="_345" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridData" type="_558" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridDataSizeByte" type="_5" location="f8:2894" file="f8" line="2894"/>
    <Argument name="gridDataTopology___unused" type="_278" location="f8:2894" file="f8" line="2894"/>
  </Function>
  <Function id="_503" name="frShapeSetHeteroVolume" returns="_277" context="_1" location="f8:2895" file="f8" line="2895" extern="1" mangled="?frShapeSetHeteroVolume@@9">
    <Argument name="shape" type="_290" location="f8:2895" file="f8" line="2895"/>
    <Argument name="heteroVolume" type="_295" location="f8:2895" file="f8" line="2895"/>
  </Function>
  <Function id="_504" name="frHeteroVolumeSetTransform" returns="_277" context="_1" location="f8:2896" file="f8" line="2896" extern="1" mangled="?frHeteroVolumeSetTransform@@9">
    <Argument name="out_heteroVolume" type="_295" location="f8:2896" file="f8" line="2896"/>
    <Argument name="transpose" type="_286" location="f8:2896" file="f8" line="2896"/>
    <Argument name="transform" type="_644" location="f8:2896" file="f8" line="2896"/>
  </Function>
  <Typedef id="_505" name="rpr_cl_context" type="_558" context="_1" location="f9:38" file="f9" line="38"/>
  <Typedef id="_506" name="rpr_cl_device" type="_558" context="_1" location="f9:39" file="f9" line="39"/>
  <Typedef id="_507" name="rpr_cl_command_queue" type="_558" context="_1" location="f9:40" file="f9" line="40"/>
  <Typedef id="_508" name="rpr_cl_mem" type="_558" context="_1" location="f9:41" file="f9" line="41"/>
  <Typedef id="_509" name="fr_cl_context" type="_505" context="_1" location="f9:47" file="f9" line="47"/>
  <Typedef id="_510" name="fr_cl_device" type="_506" context="_1" location="f9:48" file="f9" line="48"/>
  <Typedef id="_511" name="fr_cl_command_queue" type="_507" context="_1" location="f9:49" file="f9" line="49"/>
  <Typedef id="_512" name="fr_cl_mem" type="_508" context="_1" location="f9:50" file="f9" line="50"/>
  <FundamentalType id="_513" name="__int128" size="128" align="128"/>
  <FundamentalType id="_514" name="unsigned __int128" size="128" align="128"/>
  <FundamentalType id="_515" name="long long unsigned int" size="64" align="64"/>
  <PointerType id="_516" type="_554" size="64" align="64"/>
  <FundamentalType id="_517" name="void" size="0" align="8"/>
  <PointerType id="_518" type="_516" size="64" align="64"/>
  <FundamentalType id="_519" name="long long int" size="64" align="64"/>
  <FundamentalType id="_520" name="bool" size="8" align="8"/>
  <PointerType id="_521" type="_659c" size="64" align="64"/>
  <FundamentalType id="_522" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_523" name="int" size="32" align="32"/>
  <FundamentalType id="_524" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_525" name="long int" size="32" align="32"/>
  <Field id="_526" name="_locale_pctype" type="_660" context="_27" access="public" location="f3:484" file="f3" line="484" offset="0"/>
  <Field id="_527" name="_locale_mb_cur_max" type="_523" context="_27" access="public" location="f3:485" file="f3" line="485" offset="64"/>
  <Field id="_528" name="_locale_lc_codepage" type="_522" context="_27" access="public" location="f3:486" file="f3" line="486" offset="96"/>
  <Constructor id="_529" name="__crt_locale_data_public" context="_27" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1"/>
  <Constructor id="_530" name="__crt_locale_data_public" context="_27" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1">
    <Argument type="_661" location="f3:482" file="f3" line="482"/>
  </Constructor>
  <OperatorMethod id="_531" name="=" returns="_662" context="_27" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1" mangled="??4__crt_locale_data_public@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_661" location="f3:482" file="f3" line="482"/>
  </OperatorMethod>
  <Destructor id="_532" name="__crt_locale_data_public" context="_27" access="public" location="f3:482" file="f3" line="482" inline="1" artificial="1"/>
  <Field id="_533" name="locinfo" type="_663" context="_29" access="public" location="f3:491" file="f3" line="491" offset="0"/>
  <Field id="_534" name="mbcinfo" type="_664" context="_29" access="public" location="f3:492" file="f3" line="492" offset="64"/>
  <Constructor id="_535" name="__crt_locale_pointers" context="_29" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1"/>
  <Constructor id="_536" name="__crt_locale_pointers" context="_29" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1">
    <Argument type="_665" location="f3:489" file="f3" line="489"/>
  </Constructor>
  <OperatorMethod id="_537" name="=" returns="_666" context="_29" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1" mangled="??4__crt_locale_pointers@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_665" location="f3:489" file="f3" line="489"/>
  </OperatorMethod>
  <Destructor id="_538" name="__crt_locale_pointers" context="_29" access="public" location="f3:489" file="f3" line="489" inline="1" artificial="1"/>
  <PointerType id="_539" type="_30" size="64" align="64"/>
  <Field id="_540" name="_Wchar" type="_551" context="_32" access="public" location="f3:499" file="f3" line="499" offset="0"/>
  <Field id="_541" name="_Byte" type="_524" context="_32" access="public" location="f3:500" file="f3" line="500" offset="32"/>
  <Field id="_542" name="_State" type="_524" context="_32" access="public" location="f3:500" file="f3" line="500" offset="48"/>
  <Constructor id="_543" name="_Mbstatet" context="_32" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1"/>
  <Constructor id="_544" name="_Mbstatet" context="_32" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1">
    <Argument type="_667" location="f3:497" file="f3" line="497"/>
  </Constructor>
  <OperatorMethod id="_545" name="=" returns="_668" context="_32" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1" mangled="??4_Mbstatet@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_667" location="f3:497" file="f3" line="497"/>
  </OperatorMethod>
  <Destructor id="_546" name="_Mbstatet" context="_32" access="public" location="f3:497" file="f3" line="497" inline="1" artificial="1"/>
  <Enumeration id="_547" name="_Uninitialized" context="_39" location="f4:612" file="f4" line="612" size="32" align="32">
    <EnumValue name="_Noinit" init="0"/>
  </Enumeration>
  <Class id="_548" name="_Lockit" context="_39" location="f4:621" file="f4" line="621" members="_669 _670 _671 _672 _673 _674 _675 _676 _677" size="32" align="32"/>
  <Class id="_549" name="_Init_locks" context="_39" location="f4:764" file="f4" line="764" members="_678 _679 _680 _681 _682 _683" size="8" align="8"/>
  <PointerType id="_550" type="_684" size="64" align="64"/>
  <FundamentalType id="_551" name="long unsigned int" size="32" align="32"/>
  <Unimplemented id="_552" type_class="Decltype"/>
  <FundamentalType id="_553" name="double" size="64" align="64"/>
  <FundamentalType id="_554" name="char" size="8" align="8"/>
  <FundamentalType id="_555" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_556" name="short int" size="16" align="16"/>
  <FundamentalType id="_557" name="float" size="32" align="32"/>
  <PointerType id="_558" type="_517" size="64" align="64"/>
  <Field id="_559" name="image_width" type="_48" context="_116" access="public" location="f8:728" file="f8" line="728" offset="0"/>
  <Field id="_560" name="image_height" type="_48" context="_116" access="public" location="f8:729" file="f8" line="729" offset="32"/>
  <Field id="_561" name="image_depth" type="_48" context="_116" access="public" location="f8:730" file="f8" line="730" offset="64"/>
  <Field id="_562" name="image_row_pitch" type="_48" context="_116" access="public" location="f8:731" file="f8" line="731" offset="96"/>
  <Field id="_563" name="image_slice_pitch" type="_48" context="_116" access="public" location="f8:732" file="f8" line="732" offset="128"/>
  <Constructor id="_564" name="_rpr_image_desc" context="_116" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1"/>
  <Constructor id="_565" name="_rpr_image_desc" context="_116" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1">
    <Argument type="_685" location="f8:726" file="f8" line="726"/>
  </Constructor>
  <OperatorMethod id="_566" name="=" returns="_686" context="_116" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1" mangled="??4_rpr_image_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_685" location="f8:726" file="f8" line="726"/>
  </OperatorMethod>
  <Destructor id="_567" name="_rpr_image_desc" context="_116" access="public" location="f8:726" file="f8" line="726" inline="1" artificial="1"/>
  <Field id="_568" name="nb_element" type="_48" context="_118" access="public" location="f8:739" file="f8" line="739" offset="0"/>
  <Field id="_569" name="element_type" type="_94" context="_118" access="public" location="f8:740" file="f8" line="740" offset="32"/>
  <Field id="_570" name="element_channel_size" type="_48" context="_118" access="public" location="f8:741" file="f8" line="741" offset="64"/>
  <Constructor id="_571" name="_rpr_buffer_desc" context="_118" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1"/>
  <Constructor id="_572" name="_rpr_buffer_desc" context="_118" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1">
    <Argument type="_687" location="f8:737" file="f8" line="737"/>
  </Constructor>
  <OperatorMethod id="_573" name="=" returns="_688" context="_118" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1" mangled="??4_rpr_buffer_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_687" location="f8:737" file="f8" line="737"/>
  </OperatorMethod>
  <Destructor id="_574" name="_rpr_buffer_desc" context="_118" access="public" location="f8:737" file="f8" line="737" inline="1" artificial="1"/>
  <Field id="_575" name="fb_width" type="_48" context="_120" access="public" location="f8:748" file="f8" line="748" offset="0"/>
  <Field id="_576" name="fb_height" type="_48" context="_120" access="public" location="f8:749" file="f8" line="749" offset="32"/>
  <Constructor id="_577" name="_rpr_framebuffer_desc" context="_120" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1"/>
  <Constructor id="_578" name="_rpr_framebuffer_desc" context="_120" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1">
    <Argument type="_689" location="f8:746" file="f8" line="746"/>
  </Constructor>
  <OperatorMethod id="_579" name="=" returns="_690" context="_120" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1" mangled="??4_rpr_framebuffer_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_689" location="f8:746" file="f8" line="746"/>
  </OperatorMethod>
  <Destructor id="_580" name="_rpr_framebuffer_desc" context="_120" access="public" location="f8:746" file="f8" line="746" inline="1" artificial="1"/>
  <Field id="_581" name="gpumem_usage" type="_55" context="_122" access="public" location="f8:756" file="f8" line="756" offset="0"/>
  <Field id="_582" name="gpumem_total" type="_55" context="_122" access="public" location="f8:757" file="f8" line="757" offset="64"/>
  <Field id="_583" name="gpumem_max_allocation" type="_55" context="_122" access="public" location="f8:758" file="f8" line="758" offset="128"/>
  <Field id="_584" name="sysmem_usage" type="_55" context="_122" access="public" location="f8:759" file="f8" line="759" offset="192"/>
  <Constructor id="_585" name="_rpr_render_statistics" context="_122" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1"/>
  <Constructor id="_586" name="_rpr_render_statistics" context="_122" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1">
    <Argument type="_691" location="f8:754" file="f8" line="754"/>
  </Constructor>
  <OperatorMethod id="_587" name="=" returns="_692" context="_122" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1" mangled="??4_rpr_render_statistics@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_691" location="f8:754" file="f8" line="754"/>
  </OperatorMethod>
  <Destructor id="_588" name="_rpr_render_statistics" context="_122" access="public" location="f8:754" file="f8" line="754" inline="1" artificial="1"/>
  <Field id="_589" name="num_components" type="_48" context="_124" access="public" location="f8:766" file="f8" line="766" offset="0"/>
  <Field id="_590" name="type" type="_93" context="_124" access="public" location="f8:767" file="f8" line="767" offset="32"/>
  <Constructor id="_591" name="_rpr_image_format" context="_124" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1"/>
  <Constructor id="_592" name="_rpr_image_format" context="_124" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1">
    <Argument type="_693" location="f8:764" file="f8" line="764"/>
  </Constructor>
  <OperatorMethod id="_593" name="=" returns="_694" context="_124" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1" mangled="??4_rpr_image_format@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_693" location="f8:764" file="f8" line="764"/>
  </OperatorMethod>
  <Destructor id="_594" name="_rpr_image_format" context="_124" access="public" location="f8:764" file="f8" line="764" inline="1" artificial="1"/>
  <Field id="_595" name="w" type="_47" context="_126" access="public" location="f8:774" file="f8" line="774" offset="0"/>
  <Field id="_596" name="h" type="_47" context="_126" access="public" location="f8:775" file="f8" line="775" offset="32"/>
  <Field id="_597" name="data" type="_603" context="_126" access="public" location="f8:776" file="f8" line="776" offset="64"/>
  <Field id="_598" name="filename" type="_603" context="_126" access="public" location="f8:777" file="f8" line="777" offset="128"/>
  <Constructor id="_599" name="_rpr_ies_image_desc" context="_126" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1"/>
  <Constructor id="_600" name="_rpr_ies_image_desc" context="_126" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1">
    <Argument type="_695" location="f8:772" file="f8" line="772"/>
  </Constructor>
  <OperatorMethod id="_601" name="=" returns="_696" context="_126" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1" mangled="??4_rpr_ies_image_desc@@QEAAAEAU0@AEBU0@@Z">
    <Argument type="_695" location="f8:772" file="f8" line="772"/>
  </OperatorMethod>
  <Destructor id="_602" name="_rpr_ies_image_desc" context="_126" access="public" location="f8:772" file="f8" line="772" inline="1" artificial="1"/>
  <PointerType id="_603" type="_45c" size="64" align="64"/>
  <CvQualifiedType id="_45c" type="_45" const="1"/>
  <PointerType id="_604" type="_47" size="64" align="64"/>
  <PointerType id="_605" type="_70c" size="64" align="64"/>
  <CvQualifiedType id="_70c" type="_70" const="1"/>
  <PointerType id="_606" type="_58" size="64" align="64"/>
  <PointerType id="_607" type="_5" size="64" align="64"/>
  <PointerType id="_608" type="_66" size="64" align="64"/>
  <PointerType id="_609" type="_62" size="64" align="64"/>
  <PointerType id="_610" type="_117c" size="64" align="64"/>
  <CvQualifiedType id="_117c" type="_117" const="1"/>
  <PointerType id="_611" type="_517c" size="64" align="64"/>
  <CvQualifiedType id="_517c" type="_517" const="1"/>
  <PointerType id="_612" type="_63" size="64" align="64"/>
  <PointerType id="_613" type="_119c" size="64" align="64"/>
  <CvQualifiedType id="_119c" type="_119" const="1"/>
  <PointerType id="_614" type="_64" size="64" align="64"/>
  <PointerType id="_615" type="_60" size="64" align="64"/>
  <PointerType id="_616" type="_53c" size="64" align="64"/>
  <CvQualifiedType id="_53c" type="_53" const="1"/>
  <PointerType id="_617" type="_47c" size="64" align="64"/>
  <CvQualifiedType id="_47c" type="_47" const="1"/>
  <PointerType id="_618" type="_616" size="64" align="64"/>
  <PointerType id="_619" type="_5c" size="64" align="64"/>
  <CvQualifiedType id="_5c" type="_5" const="1"/>
  <PointerType id="_620" type="_617" size="64" align="64"/>
  <PointerType id="_621" type="_82c" size="64" align="64"/>
  <CvQualifiedType id="_82c" type="_82" const="1"/>
  <PointerType id="_622" type="_59" size="64" align="64"/>
  <PointerType id="_623" type="_121c" size="64" align="64"/>
  <CvQualifiedType id="_121c" type="_121" const="1"/>
  <PointerType id="_624" type="_53" size="64" align="64"/>
  <PointerType id="_625" type="_61" size="64" align="64"/>
  <PointerType id="_626" type="_67" size="64" align="64"/>
  <PointerType id="_627" type="_48" size="64" align="64"/>
  <PointerType id="_628" type="_68" size="64" align="64"/>
  <PointerType id="_629" type="_71" size="64" align="64"/>
  <PointerType id="_630" type="_554c" size="64" align="64"/>
  <CvQualifiedType id="_554c" type="_554" const="1"/>
  <PointerType id="_631" type="_69" size="64" align="64"/>
  <PointerType id="_632" type="_65" size="64" align="64"/>
  <PointerType id="_633" type="_275c" size="64" align="64"/>
  <CvQualifiedType id="_275c" type="_275" const="1"/>
  <PointerType id="_634" type="_277" size="64" align="64"/>
  <PointerType id="_635" type="_300c" size="64" align="64"/>
  <CvQualifiedType id="_300c" type="_300" const="1"/>
  <PointerType id="_636" type="_288" size="64" align="64"/>
  <PointerType id="_637" type="_296" size="64" align="64"/>
  <PointerType id="_638" type="_292" size="64" align="64"/>
  <PointerType id="_639" type="_347c" size="64" align="64"/>
  <CvQualifiedType id="_347c" type="_347" const="1"/>
  <PointerType id="_640" type="_293" size="64" align="64"/>
  <PointerType id="_641" type="_349c" size="64" align="64"/>
  <CvQualifiedType id="_349c" type="_349" const="1"/>
  <PointerType id="_642" type="_294" size="64" align="64"/>
  <PointerType id="_643" type="_290" size="64" align="64"/>
  <PointerType id="_644" type="_283c" size="64" align="64"/>
  <CvQualifiedType id="_283c" type="_283" const="1"/>
  <PointerType id="_645" type="_277c" size="64" align="64"/>
  <CvQualifiedType id="_277c" type="_277" const="1"/>
  <PointerType id="_646" type="_644" size="64" align="64"/>
  <PointerType id="_647" type="_645" size="64" align="64"/>
  <PointerType id="_648" type="_312c" size="64" align="64"/>
  <CvQualifiedType id="_312c" type="_312" const="1"/>
  <PointerType id="_649" type="_289" size="64" align="64"/>
  <PointerType id="_650" type="_351c" size="64" align="64"/>
  <CvQualifiedType id="_351c" type="_351" const="1"/>
  <PointerType id="_651" type="_283" size="64" align="64"/>
  <PointerType id="_652" type="_291" size="64" align="64"/>
  <PointerType id="_653" type="_297" size="64" align="64"/>
  <PointerType id="_654" type="_278" size="64" align="64"/>
  <PointerType id="_655" type="_298" size="64" align="64"/>
  <PointerType id="_656" type="_301" size="64" align="64"/>
  <PointerType id="_657" type="_299" size="64" align="64"/>
  <PointerType id="_658" type="_295" size="64" align="64"/>
  <CvQualifiedType id="_659c" type="_659" const="1"/>
  <PointerType id="_660" type="_524c" size="64" align="64"/>
  <CvQualifiedType id="_524c" type="_524" const="1"/>
  <ReferenceType id="_661" type="_27c"/>
  <CvQualifiedType id="_27c" type="_27" const="1"/>
  <ReferenceType id="_662" type="_27"/>
  <PointerType id="_663" type="_697" size="64" align="64"/>
  <PointerType id="_664" type="_698" size="64" align="64"/>
  <ReferenceType id="_665" type="_29c"/>
  <CvQualifiedType id="_29c" type="_29" const="1"/>
  <ReferenceType id="_666" type="_29"/>
  <ReferenceType id="_667" type="_32c"/>
  <CvQualifiedType id="_32c" type="_32" const="1"/>
  <ReferenceType id="_668" type="_32"/>
  <Constructor id="_669" name="_Lockit" context="_548" access="public" location="f4:644" file="f4" line="644"/>
  <Constructor id="_670" name="_Lockit" context="_548" access="public" location="f4:645" file="f4" line="645" explicit="1">
    <Argument type="_523" location="f4:645" file="f4" line="645"/>
  </Constructor>
  <Destructor id="_671" name="_Lockit" context="_548" access="public" location="f4:646" file="f4" line="646"/>
  <Method id="_672" name="_Lockit_ctor" returns="_517" context="_548" access="public" location="f4:649" file="f4" line="649" static="1" mangled="?_Lockit_ctor@_Lockit@std@@SAXH@Z">
    <Argument type="_523" location="f4:649" file="f4" line="649"/>
  </Method>
  <Method id="_673" name="_Lockit_dtor" returns="_517" context="_548" access="public" location="f4:650" file="f4" line="650" static="1" mangled="?_Lockit_dtor@_Lockit@std@@SAXH@Z">
    <Argument type="_523" location="f4:650" file="f4" line="650"/>
  </Method>
  <Method id="_674" name="_Lockit_ctor" returns="_517" context="_548" access="private" location="f4:653" file="f4" line="653" static="1" mangled="?_Lockit_ctor@_Lockit@std@@CAXPEAV12@@Z">
    <Argument type="_699" location="f4:653" file="f4" line="653"/>
  </Method>
  <Method id="_675" name="_Lockit_ctor" returns="_517" context="_548" access="private" location="f4:654" file="f4" line="654" static="1" mangled="?_Lockit_ctor@_Lockit@std@@CAXPEAV12@H@Z">
    <Argument type="_699" location="f4:654" file="f4" line="654"/>
    <Argument type="_523" location="f4:654" file="f4" line="654"/>
  </Method>
  <Method id="_676" name="_Lockit_dtor" returns="_517" context="_548" access="private" location="f4:655" file="f4" line="655" static="1" mangled="?_Lockit_dtor@_Lockit@std@@CAXPEAV12@@Z">
    <Argument type="_699" location="f4:655" file="f4" line="655"/>
  </Method>
  <Field id="_677" name="_Locktype" type="_523" context="_548" access="private" location="f4:662" file="f4" line="662" offset="0"/>
  <Constructor id="_678" name="_Init_locks" context="_549" access="public" location="f4:780" file="f4" line="780"/>
  <Destructor id="_679" name="_Init_locks" context="_549" access="public" location="f4:781" file="f4" line="781"/>
  <Method id="_680" name="_Init_locks_ctor" returns="_517" context="_549" access="private" location="f4:785" file="f4" line="785" static="1" mangled="?_Init_locks_ctor@_Init_locks@std@@CAXPEAV12@@Z">
    <Argument type="_700" location="f4:785" file="f4" line="785"/>
  </Method>
  <Method id="_681" name="_Init_locks_dtor" returns="_517" context="_549" access="private" location="f4:786" file="f4" line="786" static="1" mangled="?_Init_locks_dtor@_Init_locks@std@@CAXPEAV12@@Z">
    <Argument type="_700" location="f4:786" file="f4" line="786"/>
  </Method>
  <Constructor id="_682" name="_Init_locks" context="_549" access="public" location="f4:764" file="f4" line="764" inline="1" artificial="1">
    <Argument type="_701" location="f4:764" file="f4" line="764"/>
  </Constructor>
  <OperatorMethod id="_683" name="=" returns="_702" context="_549" access="public" location="f4:764" file="f4" line="764" inline="1" artificial="1" mangled="??4_Init_locks@std@@QEAAAEAV01@AEBV01@@Z">
    <Argument type="_701" location="f4:764" file="f4" line="764"/>
  </OperatorMethod>
  <ReferenceType id="_685" type="_116c"/>
  <CvQualifiedType id="_116c" type="_116" const="1"/>
  <ReferenceType id="_686" type="_116"/>
  <ReferenceType id="_687" type="_118c"/>
  <CvQualifiedType id="_118c" type="_118" const="1"/>
  <ReferenceType id="_688" type="_118"/>
  <ReferenceType id="_689" type="_120c"/>
  <CvQualifiedType id="_120c" type="_120" const="1"/>
  <ReferenceType id="_690" type="_120"/>
  <ReferenceType id="_691" type="_122c"/>
  <CvQualifiedType id="_122c" type="_122" const="1"/>
  <ReferenceType id="_692" type="_122"/>
  <ReferenceType id="_693" type="_124c"/>
  <CvQualifiedType id="_124c" type="_124" const="1"/>
  <ReferenceType id="_694" type="_124"/>
  <ReferenceType id="_695" type="_126c"/>
  <CvQualifiedType id="_126c" type="_126" const="1"/>
  <ReferenceType id="_696" type="_126"/>
  <PointerType id="_699" type="_548" size="64" align="64"/>
  <PointerType id="_700" type="_549" size="64" align="64"/>
  <ReferenceType id="_701" type="_549c"/>
  <CvQualifiedType id="_549c" type="_549" const="1"/>
  <ReferenceType id="_702" type="_549"/>
  <FundamentalType id="_659" name="wchar_t" size="16" align="16"/>
  <FunctionType id="_684" returns="_517"/>
  <Struct id="_697" name="__crt_locale_data" context="_1" location="f3:491" file="f3" line="491" incomplete="1"/>
  <Struct id="_698" name="__crt_multibyte_data" context="_1" location="f3:492" file="f3" line="492" incomplete="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\vadefs.h"/>
  <File id="f2" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\vcruntime.h"/>
  <File id="f3" name="C:\Program Files (x86)\Windows Kits\10\Include\10.0.15063.0\ucrt\corecrt.h"/>
  <File id="f4" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\yvals.h"/>
  <File id="f5" name="D:\Install\castxml/share/castxml/clang\include\stddef.h"/>
  <File id="f6" name="D:\Install\castxml/share/castxml/clang\include/__stddef_max_align_t.h"/>
  <File id="f7" name="C:\Program Files (x86)\Microsoft Visual Studio 14.0\VC\include\cstddef"/>
  <File id="f8" name="../../../../ThirdParty/RadeonProRender SDK/Win/inc/RadeonProRender.h"/>
  <File id="f9" name="../../../../ThirdParty/RadeonProRender SDK/Win/inc/RadeonProRender_CL.h"/>
</GCC_XML>
